; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	infrared0 - mode
	infrared2 - mode
	image3 - mode
	spectrograph1 - mode
	Star1 - direction
	Star3 - direction
	Star5 - direction
	GroundStation7 - direction
	Star6 - direction
	Star0 - direction
	Star4 - direction
	GroundStation2 - direction
	Star8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 image3)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet9)
	(supports instrument1 infrared2)
	(supports instrument1 infrared0)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 Star3)
	(supports instrument2 infrared2)
	(supports instrument2 image3)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star5)
	(supports instrument3 infrared2)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 Star4)
	(calibration_target instrument3 GroundStation7)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument4 infrared2)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 Star0)
	(calibration_target instrument4 Star6)
	(supports instrument5 image3)
	(calibration_target instrument5 GroundStation2)
	(calibration_target instrument5 Star4)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon14)
)
(:goal (and
	(pointing satellite0 Phenomenon13)
	(have_image Star8 spectrograph1)
	(have_image Planet9 infrared2)
	(have_image Star10 spectrograph1)
	(have_image Planet11 spectrograph1)
	(have_image Star12 image3)
	(have_image Phenomenon13 infrared0)
	(have_image Phenomenon14 spectrograph1)
))

)

; plan
1. (turn_to satellite1 star3 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 star3)
   goals met: 0 of 8
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 8
3. (calibrate satellite1 instrument1 star3)
   added: (calibrated instrument1)
   goals met: 0 of 8
4. (turn_to satellite1 phenomenon14 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 8
5. (take_image satellite1 phenomenon14 instrument1 spectrograph1)
   added: (have_image phenomenon14 spectrograph1)
   goals met: 1 of 8
6. (turn_to satellite1 phenomenon13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 8
7. (turn_to satellite0 groundstation7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 groundstation7)
   goals met: 1 of 8
8. (take_image satellite1 phenomenon13 instrument1 infrared0)
   added: (have_image phenomenon13 infrared0)
   goals met: 2 of 8
9. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 2 of 8
10. (calibrate satellite0 instrument0 groundstation7)
   added: (calibrated instrument0)
   goals met: 2 of 8
11. (turn_to satellite0 planet9 groundstation7)
   deleted: (pointing satellite0 groundstation7)
   added: (pointing satellite0 planet9)
   goals met: 2 of 8
12. (take_image satellite0 planet9 instrument0 infrared2)
   added: (have_image planet9 infrared2)
   goals met: 3 of 8
13. (turn_to satellite0 star12 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star12)
   goals met: 3 of 8
14. (take_image satellite0 star12 instrument0 image3)
   added: (have_image star12 image3)
   goals met: 4 of 8
15. (turn_to satellite0 phenomenon13 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 phenomenon13)
   goals met: 5 of 8
16. (turn_to satellite1 planet11 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 planet11)
   goals met: 5 of 8
17. (take_image satellite1 planet11 instrument1 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 6 of 8
18. (turn_to satellite1 star10 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star10)
   goals met: 6 of 8
19. (take_image satellite1 star10 instrument1 spectrograph1)
   added: (have_image star10 spectrograph1)
   goals met: 7 of 8
20. (turn_to satellite1 star8 star10)
   deleted: (pointing satellite1 star10)
   added: (pointing satellite1 star8)
   goals met: 7 of 8
21. (take_image satellite1 star8 instrument1 spectrograph1)
   added: (have_image star8 spectrograph1)
   goals met: 8 of 8
